Feature: Регистрация пользователя

  Scenario: Успешная регистрация с уникальным email
    Given подготовлены уникальные данные нового пользователя
    And пользователь открыл страницу регистрации
    When пользователь регистрируется с уникальными данными
    Then регистрация пользователя выполнена успешно

  Scenario: Повторная регистрация существующего пользователя
    Given зарегистрированный пользователь существует
    And пользователь открыл страницу регистрации
    When пользователь повторно регистрируется с данными существующего пользователя
    Then отображается ошибка повторной регистрации
